# 参考的资源

-- https://blog.csdn.net/fashion2014/article/details/78826299/

-- https://www.bilibili.com/video/av60358581/?p=8

-- https://zhuanlan.zhihu.com/p/43289968

-- https://zhuanlan.zhihu.com/p/72223558

# 在传统的mysql IDE里运行如下代码

DROP database if exists question50;
CREATE DATABASE IF NOT EXISTS question50;
USE question50;
-- 建表
-- 学生表
CREATE TABLE `Student`(`s_id` VARCHAR(20),`s_name` VARCHAR(20) NOT NULL DEFAULT '',`s_birth` VARCHAR(20) NOT NULL DEFAULT '',`s_sex` VARCHAR(10) NOT NULL DEFAULT '',PRIMARY KEY(`s_id`)
);


-- 课程表
CREATE TABLE `Course`(
	`c_id`  VARCHAR(20),
	`c_name` VARCHAR(20) NOT NULL DEFAULT '',
	`t_id` VARCHAR(20) NOT NULL,
	PRIMARY KEY(`c_id`)
);

-- 教师表
CREATE TABLE `Teacher`(
	`t_id` VARCHAR(20),
	`t_name` VARCHAR(20) NOT NULL DEFAULT '',
	PRIMARY KEY(`t_id`)
);

-- 成绩表
CREATE TABLE `Score`(
	`s_id` VARCHAR(20),
	`c_id`  VARCHAR(20),
	`s_score` INT(3),
	PRIMARY KEY(`s_id`,`c_id`)
);
    
-- 插入学生表测试数据
insert into Student values('01' , '赵雷' , '1990-01-01' , '男');
insert into Student values('02' , '钱电' , '1990-12-21' , '男');
insert into Student values('03' , '孙风' , '1990-05-20' , '男');
insert into Student values('04' , '李云' , '1990-08-06' , '男');
insert into Student values('05' , '周梅' , '1991-12-01' , '女');
insert into Student values('06' , '吴兰' , '1992-03-01' , '女');
insert into Student values('07' , '郑竹' , '1989-07-01' , '女');
insert into Student values('08' , '王菊' , '1990-01-20' , '女');
 
-- 课程表测试数据
insert into Course values('01' , '语文' , '02');
insert into Course values('02' , '数学' , '01');
insert into Course values('03' , '英语' , '03');
-- 教师表测试数据
insert into Teacher values('01' , '张三');
insert into Teacher values('02' , '李四');
insert into Teacher values('03' , '王五');

-- 成绩表测试数据
insert into Score values('01' , '01' , 80);
insert into Score values('01' , '02' , 90);
insert into Score values('01' , '03' , 99);
insert into Score values('02' , '01' , 70);
insert into Score values('02' , '02' , 60);
insert into Score values('02' , '03' , 80);
insert into Score values('03' , '01' , 80);
insert into Score values('03' , '02' , 80);
insert into Score values('03' , '03' , 80);
insert into Score values('04' , '01' , 50);
insert into Score values('04' , '02' , 30);
insert into Score values('04' , '03' , 20);
insert into Score values('05' , '01' , 76);
insert into Score values('05' , '02' , 87);
insert into Score values('06' , '01' , 31);
insert into Score values('06' , '03' , 34);
insert into Score values('07' , '02' , 89);
insert into Score values('07' , '03' , 98);

# 查看这四个表

In [1]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')

sql_1 = '''
select  *from student ;
'''
sql_2 = '''
select  *from score ;
'''
sql_3 = '''
select  * from Teacher ;
'''
sql_4 = '''
select  * from Course ;
'''
df_stu = pd.read_sql_query(text(sql_1), engine)
df_stu.head()

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  s_id s_name     s_birth s_sex
0   01     赵雷  1990-01-01     男
1   02     钱电  1990-12-21     男
2   03     孙风  1990-05-20     男
3   04     李云  1990-08-06     男
4   05     周梅  1991-12-01     女

In [2]:
df_score = pd.read_sql_query(text(sql_2), engine)
df_score.head()

  s_id c_id  s_score
0   01   01       80
1   01   02       90
2   01   03       99
3   02   01       70
4   02   02       60

In [3]:
df_teacher = pd.read_sql_query(text(sql_3), engine)
df_teacher.head(2)

  t_id t_name
0   01     张三
1   02     李四

In [4]:
df_course = pd.read_sql_query(text(sql_4), engine)
df_course.head()

  c_id c_name t_id
0   01     语文   02
1   02     数学   01
2   03     英语   03

![](./guanxibiao.png)

# 第一题  查询"01"课程比"02"课程成绩高的学生的信息及课程分数

In [5]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select  a.*,b.s_score as 01_score,c.s_score as 02_score
from student a
inner join (select s_id,s_score from score where c_id = '01') b on a.s_id=b.s_id
inner join (select s_id,s_score from score where c_id = '02') c on b.s_id=c.s_id
where b.s_score>c.s_score;
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head(2)

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  s_id s_name     s_birth s_sex  01_score  02_score
0   02     钱电  1990-12-21     男        70        60
1   04     李云  1990-08-06     男        50        30

# 第二题 查询平均成绩大于等于60分的同学的学生编号和学生姓名和平均成绩

In [6]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select b.s_id,b.s_name,ROUND(AVG(a.s_score),2) as avg_score 
from student b 
join score a on b.s_id = a.s_id
GROUP BY b.s_id,b.s_name HAVING avg_score >=60;
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head(2)

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  s_id s_name  avg_score
0   01     赵雷      89.67
1   02     钱电      70.00

# 书写sql语句时各关键字的顺序： 
select 

from 

where 

group by 

having 

order by

# 执行顺序： 
from 

where 

group by 

having 

select 

order by

In [7]:
sql_1 = '''
select b.s_id,b.s_name,ROUND(AVG(a.s_score),2) as avg_score 
from student b 
join score a on b.s_id = a.s_id
GROUP BY b.s_id,b.s_name HAVING avg_score >=60;
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head(2)

  s_id s_name  avg_score
0   01     赵雷      89.67
1   02     钱电      70.00

## 第三题 -- 4、查询平均成绩小于60分的同学的学生编号和学生姓名和平均成绩
(包括有成绩的和无成绩的)

## 难点 ： 0 as avg_score
 要使用union

In [8]:
sql_1 = '''
select b.s_id,a.s_name ,round(avg(s_score),2) as avg_score
from student a 
join score b on b.s_id = a.s_id
group by b.s_id, a.s_name
having avg_score < 60
union 
select a.s_id,a.s_name ,0 as avg_score
from student a
where a.s_id not in (select distinct b.s_id from score b);
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id s_name  avg_score
0   04     李云      33.33
1   06     吴兰      32.50
2   08     王菊       0.00

# 第四题 查询所有同学的学生编号、学生姓名、选课总数、所有课程的总成绩

# 我的方法 ， 实际上没必要让 b 和c join, 因为 b已经有了课程ID，但是也没有错

In [9]:
sql_1 = '''
select a.s_id, a.s_name,count(distinct temp.c_name) as 选课总数,sum(temp.s_score) as 总成绩
from 
student a
join 
    (select b.s_id,b.c_id,b.s_score ,c.c_name from score b join  course c on b.c_id = c.c_id
     ) temp 
on a.s_id = temp.s_id
group by a.s_id,a.s_name;

'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id s_name  选课总数    总成绩
0   01     赵雷     3  269.0
1   02     钱电     3  210.0
2   03     孙风     3  240.0
3   04     李云     3  100.0
4   05     周梅     2  163.0

## 参考

In [10]:
sql_1 = '''
select a.s_id,a.s_name,count(b.c_id) as sum_course,sum(b.s_score) as sum_score from 
	student a 
	left join score b on a.s_id=b.s_id
	GROUP BY a.s_id,a.s_name;

'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id s_name  sum_course  sum_score
0   01     赵雷           3      269.0
1   02     钱电           3      210.0
2   03     孙风           3      240.0
3   04     李云           3      100.0
4   05     周梅           2      163.0

# 第五题  查询"李"姓老师的数量

In [11]:
sql_1 = '''
select count(t_id) from teacher where t_name like '李%';
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

   count(t_id)
0            1

# 第六题 查询学过"张三"老师授课的同学的信息

In [12]:
sql_1 = '''

select a.* from 
	student a 
	join score b on a.s_id=b.s_id where b.c_id in(
		select c_id from course where t_id =(
			select t_id from teacher where t_name = '张三'));
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id s_name     s_birth s_sex
0   01     赵雷  1990-01-01     男
1   02     钱电  1990-12-21     男
2   03     孙风  1990-05-20     男
3   04     李云  1990-08-06     男
4   05     周梅  1991-12-01     女

In [13]:
sql_1 = '''
select count(t_id) from teacher where t_name like '李%';
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

   count(t_id)
0            1

# 第七题 查询没学过"张三"老师授课的同学的信息

course a

teacher b

student c

score b

 第一步  根据教师表和课程表 得到张三老师课程id

第二步   有了课程id,结合成绩表得到相应课程id的学生id,即得到了上张三老师课的学生id

 第三步  有了上张三老师的学生id, 从学生表中使用where语句 剔除这些id

In [14]:
sql_1 = '''
select * from 
student c 
where c.s_id not in(
                 select a.s_id 
                 from 
                 student a join score b on a.s_id=b.s_id 
                 where b.c_id in (
                      select a.c_id 
                      from course a join teacher b on a.t_id = b.t_id 
                      where t_name ='张三'));
 
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id s_name     s_birth s_sex
0   06     吴兰  1992-03-01     女
1   08     王菊  1990-01-20     女

### 分解  ：  第一步 先把 教师表和 课程表连接（on t_id），得到张三老师的上课ID，

In [15]:
sql_1 = '''
select a.c_id 
from course a join teacher b on a.t_id = b.t_id 
where t_name ='张三';
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  c_id
0   02

### 分解： 第二步 先连接 student 学生表和成绩表， 筛选出 张三老师的课程(第一步已得出)，这样就得到了上 张三老师课程的 学生ID

In [16]:
sql_1 = '''
select a.s_id 
from 
student a join score b on a.s_id=b.s_id 
where b.c_id in (select a.c_id 
                 from course a 
                 join teacher b on a.t_id = b.t_id 
                 where t_name ='张三')
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id
0   01
1   02
2   03
3   04
4   05

### 第三步 ，有了特定的学生ID，则 从学生表中 排除这些id(where not in 语句)

In [17]:
sql_1 = '''
select * from 
student c 
where c.s_id not in(
                 select a.s_id 
                 from 
                 student a join score b on a.s_id=b.s_id 
                 where b.c_id in (
                                  select a.c_id 
                                  from course a join teacher b on a.t_id = b.t_id 
                                  where t_name ='张三'));
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id s_name     s_birth s_sex
0   06     吴兰  1992-03-01     女
1   08     王菊  1990-01-20     女

## 第八题 查询学过编号为"01"并且也学过编号为"02"的课程的同学的信息



内连接查询:

内连接格式1:显示的内连接

select a.*,b.* from a [inner] join b on ab表的连接条件;

内连接格式2:隐式的内连接

select a.*,b.* from a,b where ab表的连接条件

注意:隐式内连接的关键词为where ,显示内连接的关键词为join和on,先记住隐式内连接即可

外连接查询:

左外连接:select a.*,b.* from a left [outer] join b on ab表的连接条件;


右外连接:select a.*,b.* from b right [outer] join a on 连接条件;


注意:外连接的关键词为join和on

链接：https://www.jianshu.com/p/c3a775ee550e

### 法一 使用隐式内连接

In [18]:
sql_1 = '''
select a.* from 
	student a,score b,score c 
	where a.s_id = b.s_id  and a.s_id = c.s_id and b.c_id='01' and c.c_id='02';
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id s_name     s_birth s_sex
0   01     赵雷  1990-01-01     男
1   02     钱电  1990-12-21     男
2   03     孙风  1990-05-20     男
3   04     李云  1990-08-06     男
4   05     周梅  1991-12-01     女

# 法二   显示内连接  分别找到 学过 01 02 的学生id ,取交集
# 然后和学生表 join

In [19]:
sql_1 = '''
select c.s_id from score c where c.c_id = '01';
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id
0   01
1   02
2   03
3   04
4   05

In [20]:
sql_1 = '''
select c.s_id from score c where c.c_id = '02';
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id
0   01
1   02
2   03
3   04
4   05

# 下面就有了上面两串id的  交集  （使用 inner join）
#limit 3

In [21]:
sql_1 = '''
select c01.s_id from 
(select c.s_id from score c where c.c_id = '01' ) c01 
 inner join 
(select c.s_id from score c where c.c_id = '02') c02 
on c01.s_id =c02.s_id;
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id
0   01
1   02
2   03
3   04
4   05

In [22]:
sql_1 = '''
select c01.s_id from 
(select c.s_id from score c where c.c_id = '01' ) c01 
 inner join 
(select c.s_id from score c where c.c_id = '02') c02 
on c01.s_id =c02.s_id;
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id
0   01
1   02
2   03
3   04
4   05

# 将上面的表作为整体 ,取名 temp ，再与学生表join,得到信息,

### 记得去掉 嵌套表的封号， 整套代码只能由一个封号

In [23]:
sql_1 = '''
select stu.s_id,stu.s_name ,stu.s_sex,stu.s_birth 
from 
student stu
join (
        select c01.s_id from 
        (select c.s_id from score c where c.c_id = '01' ) c01 
         inner join 
        (select c.s_id from score c where c.c_id = '02') c02 
        on c01.s_id =c02.s_id
        ) temp
        
on stu.s_id = temp.s_id;
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id s_name s_sex     s_birth
0   01     赵雷     男  1990-01-01
1   02     钱电     男  1990-12-21
2   03     孙风     男  1990-05-20
3   04     李云     男  1990-08-06
4   05     周梅     女  1991-12-01

# 法三   使用where    in

In [24]:
sql_1 = '''
select a.* from 
	student a 
	where a.s_id in (select s_id from score where c_id='01' ) and a.s_id in (select s_id from score where c_id='02') 
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id s_name     s_birth s_sex
0   01     赵雷  1990-01-01     男
1   02     钱电  1990-12-21     男
2   03     孙风  1990-05-20     男
3   04     李云  1990-08-06     男
4   05     周梅  1991-12-01     女

# 第九题 查询学过编号为"01"但是没有学过编号为"02"的课程的同学的信息

##  使用  where in  and  where not in

In [25]:
sql_1 = '''
select a.* from 
student a 
where a.s_id in (select s_id from score where c_id='01' ) and a.s_id not in (select s_id from score where c_id='02') 
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id s_name     s_birth s_sex
0   06     吴兰  1992-03-01     女

# pandas 方法  没成功

df_score[(df_score.c_id == '02')| (df_score.c_id == '01')]

df_score[df_score['c_id'].isin(['02','01'])  ]

df_score.groupby(['s_id']).isin(['02','01'])

In [26]:
#df_score.query('c_id == '01' ')
df_score.query(" c_id=='01' or c_id=='02'" )

   s_id c_id  s_score
0    01   01       80
1    01   02       90
3    02   01       70
4    02   02       60
6    03   01       80
7    03   02       80
9    04   01       50
10   04   02       30
12   05   01       76
13   05   02       87
14   06   01       31
16   07   02       89

In [27]:
df_score_01 =df_score.query(" c_id=='01'" )
df_score_02 =df_score.query(" c_id=='02'" )

In [28]:
#help(pd.concat)
help(pd.merge)

Help on function merge in module pandas.core.reshape.merge:

merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False, right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None)
    Merge DataFrame or named Series objects with a database-style join.

    The join is done on columns or indexes. If joining columns on
    columns, the DataFrame indexes *will be ignored*. Otherwise if joining indexes
    on indexes or indexes on a column or columns, the index will be passed on.

    Parameters
    ----------
    left : DataFrame
    right : DataFrame or named Series
        Object to merge with.
    how : {'left', 'right', 'outer', 'inner'}, default 'inner'
        Type of merge to be performed.

        * left: use only keys from left frame, similar to a SQL left outer join;
          preserve key order.
        * right: use only keys from right frame, similar to a SQL right outer join;
          preserve key order.
        * outer: use union of keys from both frames, similar to a SQL full outer
          join; sort keys lexicographically.
        * inner: use intersection of keys from both frames, similar to a SQL inner
          join; preserve the order of the left keys.
    on : label or list
        Column or index level names to join on. These must be found in both
        DataFrames. If `on` is None and not merging on indexes then this defaults
        to the intersection of the columns in both DataFrames.
    left_on : label or list, or array-like
        Column or index level names to join on in the left DataFrame. Can also
        be an array or list of arrays of the length of the left DataFrame.
        These arrays are treated as if they are columns.
    right_on : label or list, or array-like
        Column or index level names to join on in the right DataFrame. Can also
        be an array or list of arrays of the length of the right DataFrame.
        These arrays are treated as if they are columns.
    left_index : bool, default False
        Use the index from the left DataFrame as the join key(s). If it is a
        MultiIndex, the number of keys in the other DataFrame (either the index
        or a number of columns) must match the number of levels.
    right_index : bool, default False
        Use the index from the right DataFrame as the join key. Same caveats as
        left_index.
    sort : bool, default False
        Sort the join keys lexicographically in the result DataFrame. If False,
        the order of the join keys depends on the join type (how keyword).
    suffixes : tuple of (str, str), default ('_x', '_y')
        Suffix to apply to overlapping column names in the left and right
        side, respectively. To raise an exception on overlapping columns use
        (False, False).
    copy : bool, default True
        If False, avoid copy if possible.
    indicator : bool or str, default False
        If True, adds a column to output DataFrame called "_merge" with
        information on the source of each row.
        If string, column with information on source of each row will be added to
        output DataFrame, and column will be named value of string.
        Information column is Categorical-type and takes on a value of "left_only"
        for observations whose merge key only appears in 'left' DataFrame,
        "right_only" for observations whose merge key only appears in 'right'
        DataFrame, and "both" if the observation's merge key is found in both.

    validate : str, optional
        If specified, checks if merge is of specified type.

        * "one_to_one" or "1:1": check if merge keys are unique in both
          left and right datasets.
        * "one_to_many" or "1:m": check if merge keys are unique in left
          dataset.
        * "many_to_one" or "m:1": check if merge keys are unique in right
          dataset.
        * "many_to_many" or "m:m": allowed, but does not result in checks.

        .. versionadded:: 0.21.0

    Returns
    -------
    DataFrame
        A DataFrame of the two merged objects.

    See Also
    --------
    merge_ordered : Merge with optional filling/interpolation.
    merge_asof : Merge on nearest keys.
    DataFrame.join : Similar method using indices.

    Notes
    -----
    Support for specifying index levels as the `on`, `left_on`, and
    `right_on` parameters was added in version 0.23.0
    Support for merging named Series objects was added in version 0.24.0

    Examples
    --------

    >>> df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [1, 2, 3, 5]})
    >>> df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
    ...                     'value': [5, 6, 7, 8]})
    >>> df1
        lkey value
    0   foo      1
    1   bar      2
    2   baz      3
    3   foo      5
    >>> df2
        rkey value
    0   foo      5
    1   bar      6
    2   baz      7
    3   foo      8

    Merge df1 and df2 on the lkey and rkey columns. The value columns have
    the default suffixes, _x and _y, appended.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey')
      lkey  value_x rkey  value_y
    0  foo        1  foo        5
    1  foo        1  foo        8
    2  foo        5  foo        5
    3  foo        5  foo        8
    4  bar        2  bar        6
    5  baz        3  baz        7

    Merge DataFrames df1 and df2 with specified left and right suffixes
    appended to any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey',
    ...           suffixes=('_left', '_right'))
      lkey  value_left rkey  value_right
    0  foo           1  foo            5
    1  foo           1  foo            8
    2  foo           5  foo            5
    3  foo           5  foo            8
    4  bar           2  bar            6
    5  baz           3  baz            7

    Merge DataFrames df1 and df2, but raise an exception if the DataFrames have
    any overlapping columns.

    >>> df1.merge(df2, left_on='lkey', right_on='rkey', suffixes=(False, False))
    Traceback (most recent call last):
    ...
    ValueError: columns overlap but no suffix specified:
        Index(['value'], dtype='object')

# 第十题 查询没有学全所有课程的同学的信息

In [29]:
sql_1 = '''
select s.* from student s 
left join Score s1 on s1.s_id=s.s_id
group by s.s_id having count(s1.c_id)<(select count(*) from course)	
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id s_name     s_birth s_sex
0   05     周梅  1991-12-01     女
1   06     吴兰  1992-03-01     女
2   07     郑竹  1989-07-01     女
3   08     王菊  1990-01-20     女

# 第十一题 查询至少有一门课与学号为"01"的同学所学相同的同学的信息

In [30]:
sql_1 = '''
select * 
from student 
where s_id in(
             select distinct a.s_id 
             from score a where a.c_id in 
                                       (select a.c_id from score a where a.s_id='01')
	         );

'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id s_name     s_birth s_sex
0   01     赵雷  1990-01-01     男
1   02     钱电  1990-12-21     男
2   03     孙风  1990-05-20     男
3   04     李云  1990-08-06     男
4   05     周梅  1991-12-01     女

# 第十二题 查询没有学全所有课程的同学的信息

In [31]:
sql_1 = '''
select s.* from student s 
left join Score s1 on s1.s_id=s.s_id
group by s.s_id
having count(s1.c_id)<(select count(*) from course);
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id s_name     s_birth s_sex
0   05     周梅  1991-12-01     女
1   06     吴兰  1992-03-01     女
2   07     郑竹  1989-07-01     女
3   08     王菊  1990-01-20     女

# 第十三题 查询和"01"号的同学学习的课程完全相同的其他同学的信息 

号称最难的题   https://blog.csdn.net/paul0127/article/details/82529216

有点巧合

In [32]:
sql_1 = '''
select * from student
where s_id in(
    select s_id from score
    where c_id in (select c_id from score where s_id = '01') and s_id <>'01'
    group by s_id
    having COUNT(c_id)>=3
)

'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id s_name     s_birth s_sex
0   02     钱电  1990-12-21     男
1   03     孙风  1990-05-20     男
2   04     李云  1990-08-06     男

# 第十四题  查询没学过"张三"老师讲授的任一门课程的学生姓名 
#### 第一步  先找到张三老师的id  
#### 第二步  根据id找到课程id
#### 第三步  再根据课程id 在成绩表中得到学生id
#### 第四步 ，有了学生id ，筛选出姓名

In [33]:
sql_1 = '''
select a.s_name 
from student a 
where a.s_id not in (
                    select s_id 
                    from score 
                    where c_id = (select c_id from course where t_id =(select t_id from teacher where t_name = '张三') )
                                                        
                    );
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_name
0     吴兰
1     王菊

## 法二 使用隐示内连接  把四张表连在一起看看

In [34]:
sql_1 = '''
    select s.*,c.*,t.*,sc.*
    from student as s, course as c, teacher as t, score as sc
    where s.s_id = sc.s_id
        and sc.c_id = c.c_id
        and c.t_id = t.t_id
        -- and t.t_name = '张三';
'''
df = pd.read_sql_query(text(sql_1), engine)
df

,s_id,s_name,s_birth,s_sex,c_id,c_name,t_id,t_id,t_name,s_id,c_id,s_score
0,01,赵雷,1990-01-01,男,01,语文,02,02,李四,01,01,80
1,01,赵雷,1990-01-01,男,02,数学,01,01,张三,01,02,90
2,01,赵雷,1990-01-01,男,03,英语,03,03,王五,01,03,99
3,02,钱电,1990-12-21,男,01,语文,02,02,李四,02,01,70
4,02,钱电,1990-12-21,男,02,数学,01,01,张三,02,02,60
5,02,钱电,1990-12-21,男,03,英语,03,03,王五,02,03,80
6,03,孙风,1990-05-20,男,01,语文,02,02,李四,03,01,80
7,03,孙风,1990-05-20,男,02,数学,01,01,张三,03,02,80
8,03,孙风,1990-05-20,男,03,英语,03,03,王五,03,03,80
9,04,李云,1990-08-06,男,01,语文,02,02,李四,04,01,50
10,04,李云,1990-08-06,男,02,数学,01,01,张三,04,02,30
11,04,李云,1990-08-06,男,03,英语,03,03,王五,04,03,20
12,05,周梅,1991-12-01,女,01,语文,02,02,李四,05,01,76
13,05,周梅,1991-12-01,女,02,数学,01,01,张三,05,02,87
14,06,吴兰,1992-03-01,女,01,语文,02,02,李四,06,01,31
15,06,吴兰,1992-03-01,女,03,英语,03,03,王五,06,03,34
16,07,郑竹,1989-07-01,女,02,数学,01,01,张三,07,02,89
17,07,郑竹,1989-07-01,女,03,英语,03,03,王五,07,03,98

## 对上表只取姓名，使用where not in 嵌套 取出

In [35]:
sql_1 = '''
select a.s_name from student a
where s_name not in (
    select s.s_name
    from student as s, course as c, teacher as t, score as sc
    where s.s_id = sc.s_id
        and sc.c_id = c.c_id
        and c.t_id = t.t_id
        and t.t_name = '张三'
);
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_name
0     吴兰
1     王菊

# 15 查询两门及其以上不及格课程的同学的学号，姓名及其平均成绩

### count()函数是用来统计表中记录的一个函数，返回匹配条件的行数


### count(1) 统计表中所有记录数，NULL值记录并不会被忽略；而 count(字段) 会统计该字段在表中出现的次数，忽略字段为NULL值的记录数。

### 先找到 两门及其以上不及格课程的同学的学号 ,numb这一列其实不需要，在这里是为了给大家看，验证一下是否大于等于2

## 法一   第一步  分组统计每个学生 不及格的课程数量，即新增了一列
## 再对上一步的结果筛选出大于等于2 的 学生id
## 最后  在 where in 后面筛选

In [36]:
sql_1 = '''
select s_id ,count(s_id) as numb from score 
                 where s_score<60 
                 GROUP BY s_id 
                 -- having count(1)>=2
                 having numb>=2
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id  numb
0   04     3
1   06     2

# 从上表只要id

In [37]:
sql_1 = '''
select a.s_id from (select s_id ,count(s_id) as numb from score 
                 where s_score<60 
                 GROUP BY s_id 
                 -- having count(1)>=2
                 having numb>=2) a
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id
0   04
1   06

In [38]:
sql_1 = '''
select a.s_id,a.s_name,ROUND(AVG(b.s_score))
from 
student a 
left join score b on a.s_id = b.s_id
where a.s_id in (
			    select a.s_id from (select s_id ,count(s_id) as numb from score 
                 where s_score<60 
                 GROUP BY s_id 
                 -- having count(1)>=2
                 having numb>=2) a
                 )
GROUP BY a.s_id,a.s_name
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id s_name  ROUND(AVG(b.s_score))
0   04     李云                   33.0
1   06     吴兰                   33.0

# 法二     
### 比法一简洁 , 利用count(1 ) 直接限制id数量 。不用像法一 要嵌套一次才能得到符合要求的id

In [116]:
sql_1 = '''
select s_id from score 
where s_score<60 
GROUP BY s_id 
having count(1)>=2
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id
0   04
1   06

In [40]:
sql_1 = '''
select a.s_id,a.s_name,ROUND(AVG(b.s_score))
from 
student a 
left join score b on a.s_id = b.s_id
where a.s_id in (
			     select s_id from score 
                 where s_score<60 
                 GROUP BY s_id 
                 having count(1)>=2
                 )
GROUP BY a.s_id,a.s_name
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id s_name  ROUND(AVG(b.s_score))
0   04     李云                   33.0
1   06     吴兰                   33.0

## 16、检索"01"课程分数小于60，按分数降序排列的学生信息
### 法一 使用隐示连接 连接

In [41]:
sql_1 = '''
select a.*,b.c_id,b.s_score from 
	student a,score b 
	where a.s_id = b.s_id and b.c_id='01' and b.s_score<60 ORDER BY b.s_score DESC;
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id s_name     s_birth s_sex c_id  s_score
0   04     李云  1990-08-06     男   01       50
1   06     吴兰  1992-03-01     女   01       31

### 法二 不使用隐示连接

In [42]:
sql_1 = '''
select a.*,b.c_id,b.s_score 
from 
student a join score b 
on a.s_id = b.s_id 
where b.c_id='01' and b.s_score<60 
ORDER BY b.s_score DESC;
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id s_name     s_birth s_sex c_id  s_score
0   04     李云  1990-08-06     男   01       50
1   06     吴兰  1992-03-01     女   01       31

# 法三  先根据成绩表得到id 和成绩
 ##      再 与 stu join

In [43]:
sql_1 = '''
select s_id,s_score from score 
where c_id ='01' and s_score<60
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id  s_score
0   04       50
1   06       31

In [44]:
sql_1 = '''
select stu.* ,temp.s_score from 
student stu
join 
    (select s_id,s_score from score 
    where c_id ='01' and s_score<60) temp
on stu.s_id = temp.s_id
    order by temp.s_score DESC
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id s_name     s_birth s_sex  s_score
0   04     李云  1990-08-06     男       50
1   06     吴兰  1992-03-01     女       31

## 17、按平均成绩从高到低显示所有学生的所有课程的成绩以及平均成绩
#### 按照学生id 进行分组

In [45]:
sql_1 = '''
select a.s_id,(select s_score from score where s_id=a.s_id and c_id='01') as 语文,
				(select s_score from score where s_id=a.s_id and c_id='02') as 数学,
				(select s_score from score where s_id=a.s_id and c_id='03') as 英语,
			round(avg(s_score),2) as 平均分 
            from score a  
            GROUP BY a.s_id 
            ORDER BY 平均分 DESC;
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  s_id    语文    数学    英语    平均分
0   07   NaN  89.0  98.0  93.50
1   01  80.0  90.0  99.0  89.67
2   05  76.0  87.0   NaN  81.50
3   03  80.0  80.0  80.0  80.00
4   02  70.0  60.0  80.0  70.00

# 18.查询各科成绩最高分、最低分和平均分：

以如下形式显示：课程ID，课程name，最高分，最低分，平均分，及格率，中等率，优良率，优秀率 及格为>=60，中等为：70-80，优良为：80-90，优秀为：>=90

# 法一  第一步 得到每个学生的成绩等级  先合并，分箱

In [46]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
#max(a.s_score) as 最高分,min(a.s_score) as 最低分,
#avg(s_score) as 平均分,
sql_1 = '''
select a.s_id,a.c_id,b.c_name ,a.s_score,
(case when a.s_score>=60 then 1 else 0 end) as 及格,
(case when a.s_score>=70 and a.s_score<=80 then 1 else 0 end) as 中等 ,
(case when a.s_score>=90 then 1 else 0 end ) as 优秀
from 
score a join course b
on a.c_id =b.c_id
--  GROUP BY a.c_id
'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

   s_id c_id c_name  s_score  及格  中等  优秀
0    01   01     语文       80   1   1   0
1    01   02     数学       90   1   0   1
2    01   03     英语       99   1   0   1
3    02   01     语文       70   1   1   0
4    02   02     数学       60   1   0   0
5    02   03     英语       80   1   1   0
6    03   01     语文       80   1   1   0
7    03   02     数学       80   1   1   0
8    03   03     英语       80   1   1   0
9    04   01     语文       50   0   0   0
10   04   02     数学       30   0   0   0
11   04   03     英语       20   0   0   0
12   05   01     语文       76   1   1   0
13   05   02     数学       87   1   0   0
14   06   01     语文       31   0   0   0
15   06   03     英语       34   0   0   0
16   07   02     数学       89   1   0   0
17   07   03     英语       98   1   0   1

#   小插曲： 也可以 使用pandas 分组聚合

### 求占比

In [47]:
df.groupby(['c_id','c_name'])[['及格','中等','优秀']].sum()/df.groupby(['c_id','c_name'])[['及格','中等','优秀']].count()*100

                    及格         中等         优秀
c_id c_name
01   语文      66.666667  66.666667   0.000000
02   数学      83.333333  16.666667  16.666667
03   英语      66.666667  33.333333  33.333333

#### 或者定义一个函数求得占比

In [48]:
def zhanbi(arr) :
    return arr.sum()/arr.count()

In [49]:
result_1 =df.groupby(['c_id','c_name'])[['及格','中等','优秀']].agg(zhanbi).add_suffix('-占比')  # 前缀  add_prefix
result_1

                及格-占比     中等-占比     优秀-占比
c_id c_name
01   语文      0.666667  0.666667  0.000000
02   数学      0.833333  0.166667  0.166667
03   英语      0.666667  0.333333  0.333333

In [50]:
result_2 = df.groupby(['c_id','c_name'])['s_score'].agg(['sum','max', 'min', 'std'])#.rename(columns ={'和','最大值','最小值','均方根'})
result_2

             sum  max  min        std
c_id c_name
01   语文      387   80   31  19.877123
02   数学      436   90   30  23.695288
03   英语      411   99   20  33.488804

In [51]:
result_2.rename(columns ={'sum':'和','max':'最大值','min':'最小值','std':'均方根'},inplace=True)

In [52]:
print(type(result_2))

<class 'pandas.core.frame.DataFrame'>

In [53]:
pd.merge(result_1,result_2,left_on ='c_id',right_on = 'c_id')

         及格-占比     中等-占比     优秀-占比    和  最大值  最小值        均方根
c_id
01    0.666667  0.666667  0.000000  387   80   31  19.877123
02    0.833333  0.166667  0.166667  436   90   30  23.695288
03    0.666667  0.333333  0.333333  411   99   20  33.488804

## 插曲结束

### 法一 的 第二步   对第一步的结果进行统计占比

In [117]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
#max(a.s_score) as 最高分,min(a.s_score) as 最低分,
#avg(s_score) as 平均分,
sql_1 = '''
select temp.c_id,temp .c_name , max(temp.s_score) as 各个科目最大值  ,sum(temp.中等)/count(temp.中等)*100 as '各个科目中等比例(%)',
sum(temp.优秀)/count(temp.优秀)*100 as '各个科目优秀比例(%)',
sum(temp.及格)/count(temp.及格)*100 as '各个科目及格比例(%)'

from
(
select a.s_id,a.c_id,b.c_name ,a.s_score,
(case when a.s_score>=60 then 1 else 0 end) as 及格,
(case when a.s_score>=70 and a.s_score<=80 then 1 else 0 end) as 中等 ,
(case when a.s_score>=90 then 1 else 0 end ) as 优秀
from 
score a join course b
on a.c_id =b.c_id

) temp

group by temp.c_id,temp.c_name;
'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  c_id c_name  各个科目最大值  各个科目中等比例(%)  各个科目优秀比例(%)  各个科目及格比例(%)
0   01     语文       80      66.6667       0.0000      66.6667
1   02     数学       90      16.6667      16.6667      83.3333
2   03     英语       99      33.3333      33.3333      66.6667

# 法二   与法一不同的是，是在求占比时，sum（）内加一个子表
个人认为这样比较抽象，比较难

In [118]:
sql_1 = '''
select a.c_id , b.c_name, MAX(s_score) as 最高分,MIN(s_score) as 最低分,ROUND(AVG(s_score),2) as 平均分,
ROUND(100*(SUM(case when a.s_score>=60 then 1 else 0 end)/SUM(case when a.s_score then 1 else 0 end)),2) as 及格率,
ROUND(100*(SUM(case when a.s_score>=70 and a.s_score<=80 then 1 else 0 end)/SUM(case when a.s_score then 1 else 0 end)),2) as 中等率,
ROUND(100*(SUM(case when a.s_score>=80 and a.s_score<=90 then 1 else 0 end)/SUM(case when a.s_score then 1 else 0 end)),2) as 优良率,
ROUND(100*(SUM(case when a.s_score>=90 then 1 else 0 end)/SUM(case when a.s_score then 1 else 0 end)),2) as 优秀率

from 
score a left join course b 
on a.c_id = b.c_id 
GROUP BY a.c_id,b.c_name
'''
df = pd.read_sql_query(text(sql_1), engine)
df.head()

  c_id c_name  最高分  最低分    平均分    及格率    中等率    优良率    优秀率
0   01     语文   80   31  64.50  66.67  66.67  33.33   0.00
1   02     数学   90   30  72.67  83.33  16.67  66.67  16.67
2   03     英语   99   20  68.50  66.67  33.33  33.33  33.33

## 19、按各科成绩进行排序，并显示排名

https://blog.csdn.net/Athain/article/details/84944151

-- mysql没有rank函数
	select a.s_id,a.c_id,
        @i:=@i +1 as i保留排名,
        @k:=(case when @score=a.s_score then @k else @i end) as rank不保留排名,
        @score:=a.s_score as score
    from (
        select s_id,c_id,s_score from score GROUP BY s_id,c_id,s_score ORDER BY s_score DESC
)a,(select @k:=0,@i:=0,@score:=0)s

In [119]:
sql_1 = '''
select * from score a 
left join score b on a.c_id = b.c_id and a.s_score < b.s_score order by a.s_id,a.c_id

'''
df = pd.read_sql_query(text(sql_1), engine)
df

   s_id c_id  s_score  s_id  c_id  s_score
0    01   01       80  None  None      NaN
1    01   02       90  None  None      NaN
2    01   03       99  None  None      NaN
3    02   01       70    01    01     80.0
4    02   01       70    05    01     76.0
5    02   01       70    03    01     80.0
6    02   02       60    05    02     87.0
7    02   02       60    01    02     90.0
8    02   02       60    03    02     80.0
9    02   02       60    07    02     89.0
10   02   03       80    07    03     98.0
11   02   03       80    01    03     99.0
12   03   01       80  None  None      NaN
13   03   02       80    07    02     89.0
14   03   02       80    01    02     90.0
15   03   02       80    05    02     87.0
16   03   03       80    01    03     99.0
17   03   03       80    07    03     98.0
18   04   01       50    01    01     80.0
19   04   01       50    05    01     76.0
20   04   01       50    03    01     80.0
21   04   01       50    02    01     70.0
22   04   02       30    01    02     90.0
23   04   02       30    03    02     80.0
24   04   02       30    05    02     87.0
25   04   02       30    07    02     89.0
26   04   02       30    02    02     60.0
27   04   03       20    01    03     99.0
28   04   03       20    06    03     34.0
29   04   03       20    02    03     80.0
30   04   03       20    03    03     80.0
31   04   03       20    07    03     98.0
32   05   01       76    01    01     80.0
33   05   01       76    03    01     80.0
34   05   02       87    01    02     90.0
35   05   02       87    07    02     89.0
36   06   01       31    01    01     80.0
37   06   01       31    04    01     50.0
38   06   01       31    05    01     76.0
39   06   01       31    03    01     80.0
40   06   01       31    02    01     70.0
41   06   03       34    01    03     99.0
42   06   03       34    03    03     80.0
43   06   03       34    02    03     80.0
44   06   03       34    07    03     98.0
45   07   02       89    01    02     90.0
46   07   03       98    01    03     99.0

# 20、查询学生的总成绩并进行排名

In [57]:
sql_1 = '''
select sc.s_id,stu.s_name ,sum(sc.s_score) as 总成绩
from score sc 
join  student stu
on sc.s_id = stu.s_id
group by sc.s_id,stu.s_name
order by 总成绩 asc; 
-- desc

'''
df = pd.read_sql_query(text(sql_1), engine)
df

  s_id s_name    总成绩
0   06     吴兰   65.0
1   04     李云  100.0
2   05     周梅  163.0
3   07     郑竹  187.0
4   02     钱电  210.0
5   03     孙风  240.0
6   01     赵雷  269.0

# rank 函数 https://blog.csdn.net/d345389812/article/details/80683619

In [120]:
sql_1 = '''
select *,RANK() over (order by s_score desc) 排名 from score;
 '''
df = pd.read_sql_query(text(sql_1), engine)
df

   s_id c_id  s_score  排名
0    01   03       99   1
1    07   03       98   2
2    01   02       90   3
3    07   02       89   4
4    05   02       87   5
5    01   01       80   6
6    02   03       80   6
7    03   01       80   6
8    03   02       80   6
9    03   03       80   6
10   05   01       76  11
11   02   01       70  12
12   02   02       60  13
13   04   01       50  14
14   06   03       34  15
15   06   01       31  16
16   04   02       30  17
17   04   03       20  18

#  21、查询不同老师所教不同课程平均分从高到低显示

In [122]:
sql_1 = '''
select a.t_id,c.t_name,a.c_id,ROUND(avg(s_score),2) as avg_score 
from 
course a left join score b on a.c_id=b.c_id 
         left join teacher c on a.t_id=c.t_id
         GROUP BY a.c_id,a.t_id,c.t_name 
         ORDER BY avg_score DESC;
'''
df = pd.read_sql_query(text(sql_1), engine)
df

  t_id t_name c_id  avg_score
0   01     张三   02      72.67
1   03     王五   03      68.50
2   02     李四   01      64.50

# 22、查询所有课程的成绩第2名到第3名的学生信息及该课程成绩

### 第一步 ，先获得排名
#### 注意(select @i:=0)的使用

In [128]:
sql_1 = '''
select a.s_id,a.s_score,a.c_id,@i:=@i+1 as 排名 
from score a,(select @i:=0) s 
where a.c_id='01'  
ORDER BY a.s_score DESC  
;
'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1287, "Setting user variables within expressions is deprecated and will be removed in a future release. Consider alternatives: 'SET variable=expression, ...', or 'SELECT expression(s) INTO variables(s)'.")
  result = self._query(query)

  s_id  s_score c_id   排名
0   01       80   01  1.0
1   03       80   01  2.0
2   05       76   01  3.0
3   02       70   01  4.0
4   04       50   01  5.0
5   06       31   01  6.0

### 再连接学生表， 在最后限制 第二名到第三名

In [130]:
sql_1 = '''
select d.*,c.排名,c.s_score,c.c_id 
from (
    select a.s_id,a.s_score,a.c_id,@i:=@i+1 as 排名 
    from score a,(select @i:=0)s where a.c_id='01'  
	ORDER BY a.s_score DESC  
    )c
    left join student d on c.s_id=d.s_id
    where 排名 BETWEEN 2 AND 3
    
    UNION
            
            select d.*,c.排名,c.s_score,c.c_id from (
                select a.s_id,a.s_score,a.c_id,@j:=@j+1 as 排名 from score a,(select @j:=0)s where a.c_id='02'  
								ORDER BY a.s_score DESC
            )c
            left join student d on c.s_id=d.s_id
            where 排名 BETWEEN 2 AND 3
            
            UNION
            select d.*,c.排名,c.s_score,c.c_id from (
                select a.s_id,a.s_score,a.c_id,@k:=@k+1 as 排名 from score a,(select @k:=0)s where a.c_id='03' 
								ORDER BY a.s_score DESC
            )c left join student d on c.s_id=d.s_id
            where 排名 BETWEEN 2 AND 3;
'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1287, "Setting user variables within expressions is deprecated and will be removed in a future release. Consider alternatives: 'SET variable=expression, ...', or 'SELECT expression(s) INTO variables(s)'.")
  result = self._query(query)

  s_id s_name     s_birth s_sex   排名  s_score c_id
0   03     孙风  1990-05-20     男  2.0       80   01
1   05     周梅  1991-12-01     女  3.0       76   01
2   07     郑竹  1989-07-01     女  2.0       89   02
3   05     周梅  1991-12-01     女  3.0       87   02
4   07     郑竹  1989-07-01     女  2.0       98   03
5   02     钱电  1990-12-21     男  3.0       80   03

## 23. 统计各科成绩各分数段人数：课程编号，课程名称，[100-85]，[85-70]，[70-60]，[60-0] 及所占百分比
法一 https://blog.csdn.net/fashion2014/article/details/78826299/

In [131]:




/
sql_1 = '''
select distinct f.c_name,a.c_id,b.`85-100`,b.百分比,c.`70-85`,c.百分比,d.`60-70`,d.百分比,e.`0-60`,e.百分比 
from score a
left join (s
























id,SUM(case when s_score >85 and s_score <=100 then 1 else 0 end) as `85-100`,
           ROUND(100*(SUM(case when s_score >85 and s_score <=100 then 1 else 0 end)/count(*)),2) as 百分比
           from score GROUP BY c_id) b 
           on a.c_id=b.c_id
left join (select c_id,SUM(case when s_score >70 and s_score <=85 then 1 else 0 end) as `70-85`,
           ROUND(100*(SUM(case when s_score >70 and s_score <=85 then 1 else 0 end)/count(*)),2) as 百分比
           from score GROUP BY c_id) c 
           on a.c_id=c.c_id
           
left join (select c_id,SUM(case when s_score >60 and s_score <=70 then 1 else 0 end) as `60-70`,
            ROUND(100*(SUM(case when s_score >60 and s_score <=70 then 1 else 0 end)/count(*)),2) as 百分比
            from score GROUP BY c_id)d on a.c_id=d.c_id
left join (select c_id,SUM(case when s_score >=0 and s_score <=60 then 1 else 0 end) as `0-60`,
            ROUND(100*(SUM(case when s_score >=0 and s_score <=60 then 1 else 0 end)/count(*)),2) as 百分比
            from score GROUP BY c_id)e on a.c_id=e.c_id
left join course f on a.c_id = f.c_id
 
'''
df = pd.read_sql_query(text(sql_1), engine)
df

  c_name c_id  85-100    百分比  70-85    百分比  60-70    百分比  0-60    百分比
0     语文   01     0.0   0.00    3.0  50.00    1.0  16.67   2.0  33.33
1     数学   02     3.0  50.00    1.0  16.67    0.0   0.00   2.0  33.33
2     英语   03     2.0  33.33    2.0  33.33    0.0   0.00   2.0  33.33

# 法二 https://blog.csdn.net/d345389812/article/details/80683619 参考23题

## 与十八题目类似

In [61]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select C.c_name,  T.* 
from course C 
left join 
        (select SC.c_id,
        CONCAT(SUM(case when SC.s_score <= 60 then 1 else 0 end)/count(SC.s_id)*100,'%') '[0-60]',
        CONCAT(SUM(case when SC.s_score >60 and SC.s_score <= 70 then 1 else 0 end)/count(SC.s_id)*100,'%') '[60-70]',
        CONCAT(SUM(case when SC.s_score >70 and SC.s_score <= 85 then 1 else 0 end)/count(SC.s_id)*100,'%') '[70-85]',
        CONCAT(SUM(case when SC.s_score >85 and SC.s_score <= 100 then 1 else 0 end)/count(SC.s_id)*100,'%') '[85-100]'
        from score SC 
        group by SC.c_id) T
on C.c_id = T.c_id;
'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  c_name c_id    [0-60]   [60-70]   [70-85]  [85-100]
0     语文   01  33.3333%  16.6667%  50.0000%   0.0000%
1     数学   02  33.3333%   0.0000%  16.6667%  50.0000%
2     英语   03  33.3333%   0.0000%  33.3333%  33.3333%

## 24、查询学生平均成绩及其名次 

## 法一
#### 成绩重复时  不保留空缺,使用 rank() , 保留时，使用dense_rank()
参考 21 22
https://blog.csdn.net/d345389812/article/details/80683619

In [62]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select *,RANK() over (order by 平均成绩 desc) 排名 
from 
   (select s_id,AVG(s_score)平均成绩 
    from score 
    group by s_id) A;
'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  s_id     平均成绩  排名
0   07  93.5000   1
1   01  89.6667   2
2   05  81.5000   3
3   03  80.0000   4
4   02  70.0000   5
5   04  33.3333   6
6   06  32.5000   7

In [63]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select *,dense_RANK() over (order by 平均成绩 desc) 排名 
from 
   (select s_id,AVG(s_score)平均成绩 
    from score 
    group by s_id) A;
'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  s_id     平均成绩  排名
0   07  93.5000   1
1   01  89.6667   2
2   05  81.5000   3
3   03  80.0000   4
4   02  70.0000   5
5   04  33.3333   6
6   06  32.5000   7

## 法2 
https://blog.csdn.net/fashion2014/article/details/78826299/   参考24题

In [64]:

from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select a.s_id,
@i:=@i+1 as '不保留空缺排名',
@k:=(case when @avg_score=a.avg_s then @k else @i end) as '保留空缺排名',
@avg_score:=avg_s as '平均分'
from (select s_id,ROUND(AVG(s_score),2) as avg_s from score GROUP BY s_id ORDER BY avg_s DESC)a,(select @avg_score:=0,@i:=0,@k:=0)b;

'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)
C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1287, "Setting user variables within expressions is deprecated and will be removed in a future release. Consider alternatives: 'SET variable=expression, ...', or 'SELECT expression(s) INTO variables(s)'.")
  result = self._query(query)

  s_id  不保留空缺排名 保留空缺排名    平均分
0   07      1.0      1  93.50
1   01      2.0      2  89.67
2   05      3.0      3  81.50
3   03      4.0      4  80.00
4   02      5.0      5  70.00
5   04      6.0      6  33.33
6   06      7.0      7  32.50

# 25、查询各科成绩前三名的记录
# 法一
 # 1.选出b表比a表成绩大的所有组
# 2.选出比当前id成绩大的 小于三个的

In [65]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select a.s_id,a.c_id,a.s_score 
from score a 
left join score b 
on a.c_id = b.c_id and a.s_score<b.s_score
group by a.s_id,a.c_id,a.s_score
HAVING COUNT(b.s_id)<3
ORDER BY a.c_id,a.s_score DESC
'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  s_id c_id  s_score
0   01   01       80
1   03   01       80
2   05   01       76
3   01   02       90
4   07   02       89
5   05   02       87
6   01   03       99
7   07   03       98
8   02   03       80
9   03   03       80

# 法二

In [66]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select * from 
(select *,rank() over (partition by c_id order by s_score desc) 排名 from score) B
 where B.排名<=3;
'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  s_id c_id  s_score  排名
0   01   01       80   1
1   03   01       80   1
2   05   01       76   3
3   01   02       90   1
4   07   02       89   2
5   05   02       87   3
6   01   03       99   1
7   07   03       98   2
8   02   03       80   3
9   03   03       80   3

## 26、查询每门课程被选修的学生数

In [67]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select c_id,count(s_id) as 学生数量 
from score a 
GROUP BY c_id;

'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  c_id  学生数量
0   01     6
1   02     6
2   03     6

##  27、查询出只有两门课程的全部学生的学号和姓名

In [68]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select s_id,s_name from student 
where s_id in
            (
            select s_id from score 
            GROUP BY s_id 
            HAVING COUNT(c_id)=2);

'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  s_id s_name
0   05     周梅
1   06     吴兰
2   07     郑竹

# 28、查询男生、女生人数

In [69]:
		
    
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select s_sex, COUNT(s_sex) as 人数  
from student 
GROUP BY s_sex

'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  s_sex  人数
0     男   4
1     女   4

# -- 29、查询名字中含有"风"字的学生信息

In [70]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select * from student where s_name like '%风%';

'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  s_id s_name     s_birth s_sex
0   03     孙风  1990-05-20     男

## -- 30、查询同名同性学生名单，并统计同名人数

In [71]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select a.s_name,a.s_sex,count(*) 
from student a  
JOIN 
student b 
on a.s_id !=b.s_id and a.s_name = b.s_name and a.s_sex = b.s_sex
GROUP BY a.s_name,a.s_sex

'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

Empty DataFrame
Columns: [s_name, s_sex, count(*)]
Index: []

## -- 31、查询1990年出生的学生名单

In [72]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select s_name from student where s_birth like '1990%'

'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  s_name
0     赵雷
1     钱电
2     孙风
3     李云
4     王菊

## -- 32、查询每门课程的平均成绩，结果按平均成绩降序排列，平均成绩相同时，按课程编号升序排列

In [77]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
	select c_id,ROUND(AVG(s_score),2) as avg_score from score GROUP BY c_id ORDER BY avg_score DESC;

'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  c_id  avg_score
0   02      72.67
1   03      68.50
2   01      64.50

# 33、查询平均成绩大于等于85的所有学生的学号、姓名和平均成绩

In [79]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select a.s_id,b.s_name,ROUND(avg(a.s_score),2) as avg_score
from 
score a left join student b 
on a.s_id=b.s_id 
GROUP BY s_id 
HAVING avg_score>=85

'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  s_id s_name  avg_score
0   01     赵雷      89.67
1   07     郑竹      93.50

# 34、查询课程名称为"数学"，且分数低于60的学生姓名和分数

In [80]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select a.s_name,b.s_score from score b join student a on a.s_id=b.s_id where b.c_id=(
					select c_id from course where c_name ='数学') and b.s_score<60
 
'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  s_name  s_score
0     李云       30

## - 35、查询所有学生的课程及分数情况；

In [81]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select a.s_id,a.s_name,
					SUM(case c.c_name when '语文' then b.s_score else 0 end) as '语文',
					SUM(case c.c_name when '数学' then b.s_score else 0 end) as '数学',
					SUM(case c.c_name when '英语' then b.s_score else 0 end) as '英语',
					SUM(b.s_score) as  '总分'
		from student a left join score b on a.s_id = b.s_id 
		left join course c on b.c_id = c.c_id 
		GROUP BY a.s_id,a.s_name
'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  s_id s_name    语文    数学    英语     总分
0   01     赵雷  80.0  90.0  99.0  269.0
1   02     钱电  70.0  60.0  80.0  210.0
2   03     孙风  80.0  80.0  80.0  240.0
3   04     李云  50.0  30.0  20.0  100.0
4   05     周梅  76.0  87.0   0.0  163.0
5   06     吴兰  31.0   0.0  34.0   65.0
6   07     郑竹   0.0  89.0  98.0  187.0
7   08     王菊   0.0   0.0   0.0    NaN

# 36、查询任何一门课程成绩在70分以上的姓名、课程名称和分数；

In [82]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select a.s_name,b.c_name,c.s_score 
from course b left join score c 
on b.c_id = c.c_id
left join student a 
on a.s_id=c.s_id 
where c.s_score>=70

'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

   s_name c_name  s_score
0      赵雷     语文       80
1      赵雷     数学       90
2      赵雷     英语       99
3      钱电     语文       70
4      钱电     英语       80
5      孙风     语文       80
6      孙风     数学       80
7      孙风     英语       80
8      周梅     语文       76
9      周梅     数学       87
10     郑竹     数学       89
11     郑竹     英语       98

# 37、查询不及格的课程

In [84]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select a.s_id,a.c_id,b.c_name,a.s_score 
from score a left join course b 
on a.c_id = b.c_id
where a.s_score<60 ;

'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  s_id c_id c_name  s_score
0   04   01     语文       50
1   06   01     语文       31
2   04   02     数学       30
3   04   03     英语       20
4   06   03     英语       34

## 38 查询课程编号为01且课程成绩在80分以上的学生的学号和姓名；

In [86]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select a.s_id,b.s_name 
from score a LEFT JOIN student b 
on a.s_id = b.s_id
where a.c_id = '01'	and a.s_score>80
'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

Empty DataFrame
Columns: [s_id, s_name]
Index: []

# 39、求每门课程的学生人数

In [89]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select count(*) as 每门课的人数 
from score 
GROUP BY c_id;
'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

   每门课的人数
0       6
1       6
2       6

# 40、查询选修"张三"老师所授课程的学生中，成绩最高的学生信息及其成绩

In [91]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select c_id,count(*) as 每门课的人数 
from score 
GROUP BY c_id;
'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  c_id  每门课的人数
0   01       6
1   02       6
2   03       6

# 41、查询不同课程成绩相同的学生的学生编号、课程编号、学生成绩

In [92]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select DISTINCT b.s_id,b.c_id,b.s_score 
from score a,score b where a.c_id != b.c_id and a.s_score = b.s_score
	
'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  s_id c_id  s_score
0   01   01       80
1   02   03       80
2   03   01       80
3   03   02       80
4   03   03       80

##  42、查询每门功成绩最好的前两名

## 法一

In [94]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
-- 牛逼的写法
select a.s_id,a.c_id,a.s_score 
from score a
where (select COUNT(1) from score b where b.c_id=a.c_id and b.s_score>=a.s_score)<=2 
ORDER BY a.c_id
'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  s_id c_id  s_score
0   01   01       80
1   03   01       80
2   01   02       90
3   07   02       89
4   01   03       99
5   07   03       98

# 法二  rank
https://blog.csdn.net/d345389812/article/details/80683619 参考24题

In [99]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
-- 牛rank
select * from 
(select *,rank() over (partition by c_id order by s_score desc) 排名 from score) B
where B.排名<=2;
'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  s_id c_id  s_score  排名
0   01   01       80   1
1   03   01       80   1
2   01   02       90   1
3   07   02       89   2
4   01   03       99   1
5   07   03       98   2

# 43、统计每门课程的学生选修人数（超过5人的课程才统计）。要求输出课程号和选修人数，查询结果按人数降序排列，若人数相同，按课程号升序排列

In [101]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select c_id,count(*) as total from score 
GROUP BY c_id 
HAVING total>5 
ORDER BY total,c_id ASC
'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  c_id  total
0   01      6
1   02      6
2   03      6

#  44、检索至少选修两门课程的学生学号

In [103]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select s_id,count(*) as 课程数量 from score GROUP BY s_id HAVING 课程数量>=2
'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  s_id  课程数量
0   01     3
1   02     3
2   03     3
3   04     3
4   05     2
5   06     2
6   07     2

# 45、查询选修了全部课程的学生信息 

count(*) 的理解 ：
以id分组统计，查询分组后数量大于课程数的id和数量。

In [105]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select * from student where s_id in
(
select s_id 
from score 
GROUP BY s_id 
HAVING count(*)=(select count(*) from course)
)

'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  s_id s_name     s_birth s_sex
0   01     赵雷  1990-01-01     男
1   02     钱电  1990-12-21     男
2   03     孙风  1990-05-20     男
3   04     李云  1990-08-06     男

## 46、查询各学生的年龄
## 按照出生日期来算，当前月日 < 出生年月的月日则，年龄减一

In [108]:
# case when  then 0 else 1

In [109]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select s_birth,
(DATE_FORMAT(NOW(),'%Y')-DATE_FORMAT(s_birth,'%Y') - 
(case when DATE_FORMAT(NOW(),'%m%d')>DATE_FORMAT(s_birth,'%m%d') then 0 else 1 end)) as age
from student;
'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

      s_birth   age
0  1990-01-01  29.0
1  1990-12-21  28.0
2  1990-05-20  29.0
3  1990-08-06  29.0
4  1991-12-01  27.0
5  1992-03-01  27.0
6  1989-07-01  30.0
7  1990-01-20  29.0

# 47、查询本周过生日的学生

In [112]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select * from student where WEEK(DATE_FORMAT(NOW(),'%Y%m%d'))=WEEK(s_birth)
-- select * from student where YEARWEEK(s_birth)=YEARWEEK(DATE_FORMAT(NOW(),'%Y%m%d'))

-- select WEEK(DATE_FORMAT(NOW(),'%Y%m%d'));
'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

Empty DataFrame
Columns: [s_id, s_name, s_birth, s_sex]
Index: []

## 48、查询下周过生日的学生

In [113]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select * from student where WEEK(DATE_FORMAT(NOW(),'%Y%m%d'))+1 =WEEK(s_birth)
'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

Empty DataFrame
Columns: [s_id, s_name, s_birth, s_sex]
Index: []

In [ ]:
#49 、查询下个月过生日的学生

In [114]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select * from student where MONTH(DATE_FORMAT(NOW(),'%Y%m%d'))+1 =MONTH(s_birth)
'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

Empty DataFrame
Columns: [s_id, s_name, s_birth, s_sex]
Index: []

# 50. 查询各学生的年龄，只按年份来算

In [115]:
from sqlalchemy import create_engine
import pandas as pd
from sqlalchemy import text
engine=create_engine('mysql+pymysql://root:deepwind@localhost:3306/question50')
sql_1 = '''
select s_id,s_name,TIMESTAMPDIFF(YEAR,s_birth,now())年龄 from student;

'''
df = pd.read_sql_query(text(sql_1), engine)
df

C:\Users\lining\Anaconda3\lib\site-packages\pymysql\cursors.py:170: Warning: (1366, "Incorrect string value: '\\xD6\\xD0\\xB9\\xFA\\xB1\\xEA...' for column 'VARIABLE_VALUE' at row 533")
  result = self._query(query)

  s_id s_name  年龄
0   01     赵雷  29
1   02     钱电  28
2   03     孙风  29
3   04     李云  29
4   05     周梅  27
5   06     吴兰  27
6   07     郑竹  30
7   08     王菊  29

In [ ]:
select c_id,count(*) as total from score GROUP BY c_id HAVING total>5 ORDER BY total,c_id ASC

![](./guanxibiao.png)

In [1]:
import arrow
date_time_str_23 = arrow.now().format('YYYY-MM-DD') +' 23:00:00'

In [3]:
date_time_str_23

'2019-09-02 23:00:00'

In [7]:
date_time_str_23 = arrow.now().format('YYYYMMDD')+'20'
date_time_str_23

'2019090220'

In [2]:
arrow.get(date_time_str_23)